# PANDAS Z KURSU

Lektor twierdzi, że Pandas jest najbardziej użyteczny ze wszystkich poznanych już biblitek.
W swojej strukturze wykorzystuje NumPy przez co jest szybki i sprawny.
<br />
Najczęściej jest wykorzystywany do:
- wyrównania danych i ogólnie obróbką danych,
- operacji na danych,
- obsługę brakujących informacji,
- dobre narzędzie do standaryzacji
- `dataframe` oraz `series` jako główne typy danych 

**Obecnie jedno z najpowszechniej używanych narzędzi do analizy danych**

Ponadto posiada narzędzia do odczytu i zapisu danych z plików.
<br />
<br />
**Struktury danych w Pandas**
- **Series** (szeregi), czyli jednowymiarowe tablice wspierające różne typy danych
- **Data Frame**, czyli dwuwymiarowa tablica wspierająca różne typy danych. Wejściem może być również szereg lub inna ramka danych.
- **Panel**, czyli trójwymiarowa tablica... `Items` <-- oś zero, `Major axis` <-- wiersze, `Minos axis` <-- kolumny. 
- **Panel4D**, czyli czterowymiarowa tablica... `Labels` <-- oś zerowa, `Items` <-- oś pierwsza, `Major axis` <-- wiersze, `Minos axis` <-- kolumny. 
<br />

**Więcej o szeregach**<br />
Szereg może zostać utworzony z: `ndarray`, `dict`, `scalar`, `list`.

In [1]:
import pandas as pd

In [5]:
#utworzenie szeregu z listy: pd.Series(data, index=[index])
szereg = pd.Series( list('abcdefg') )

In [7]:
szereg

0    a
1    b
2    c
3    d
4    e
5    f
6    g
dtype: object

In [8]:
szereg[0]

'a'

In [6]:
a = list('aaaaacc')
print(a)

['a', 'a', 'a', 'a', 'a', 'c', 'c']

Jak widać powyżej przy tworzeniu listy z łańcucha znaków, lista rozkłada łańcuch na poszczególne elementy. Przy tworzeniu szeregu każdy element dodatkowo jest indeksowany. Na dole widać typ elementów. Lista przechodzi jako obiekt.

In [11]:
#utworzenie szeregu z ndarray:
import numpy as np

In [12]:
kraje = np.array(['Luxemburg', 'Polska', 'Białoruś', 'Czechy', 'Litwa'])

In [13]:
s_kraje = pd.Series(kraje)

In [14]:
print(s_kraje)

0    Luxemburg
1       Polska
2     Białoruś
3       Czechy
4        Litwa
dtype: object

Szereg bardzo często tworzy się ze słowników lub podając indeksy jawnie, jako argument:

In [15]:
#utworzenie szeregu z jawnymi etykietami:
s_et = pd.Series([213.0,12444.2,444.2,43.211],index=['pierwsza','druga etykieta','jakaś inna','o! jeszcze insza'])

In [16]:
print( s_et )

pierwsza              213.000
druga etykieta      12444.200
jakaś inna            444.200
o! jeszcze insza       43.211
dtype: float64

Jak widać tutaj jest już inny typ danych, ponieważ wartości zostały podane jako float64

In [17]:
s_et['pierwsza']

213.0

In [23]:
s_et[0]

213.0

In [20]:
#utworzeie szeregu ze skalara:
s_scal = pd.Series(5.,index=['a','b','c','d','e'])

In [21]:
print(s_scal)

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

Tutaj każdy element ma wartość skalara.

Bardziej preferowaną metodą (na kursie) jest użycie metod:<br />
`s_szereg.loc['nazwaPola']` <-- locate <br />
`s_szereg.iloc[0]` <-- index locate

In [24]:
s_et.loc['o! jeszcze insza']

43.211

In [25]:
s_et.loc['o! jeszcze insza'] == s_et['o! jeszcze insza']

True

In [26]:
s_et.iloc[1]

12444.2

In [28]:
s_et[1] == s_et.iloc[1]

True

# Operacje na szeregach

**dodawanie wartosci po indexach**

In [29]:
# dodawanie z indeksowaniem po kolei
s_pie = pd.Series([1,2,3,4],index=['a','b','c','d'])
s_dru = pd.Series([10,22,33,14],index=['a','b','c','d'])

In [30]:
s_pie+s_dru

a    11
b    24
c    36
d    18
dtype: int64

In [31]:
#dodawanie z indeksowaniem na wspak
s_dru = pd.Series([10,22,33,14],index=['d','b','a','c'])
s_pie+s_dru

a    34
b    24
c    17
d    14
dtype: int64

Jak widać wynik jest różny. Elementy zostały dodane według indeksów. 
Czyli np. 'a' (w s_pie = 1) do 'a' (w s_dru = 33) dają wynik 34.
<br />
<br />
W przypadku pomyłki z indeksami:

In [33]:
s_dru = pd.Series([10,22,33,14],index=['d','b','f','g']) #<-- inne indeksy
s_pie+s_dru

a     NaN
b    24.0
c     NaN
d    14.0
f     NaN
g     NaN
dtype: float64

Dla pojedynczych indeksów zwrócone zostaje `NaN`, czyli Not a Number.

# Ramki danych

Przypomina tablicę SQL, różne kolumny mogą zawierać inne rodzaje danych. 
Ramkę danych (Data Frame) można utworzyć z: `ndarray`, `dict`, `list`, `Series`, innej `DataFrame`.

In [4]:
#utworzenie ze słownika zawierającego listy:
olympicDataDict = {'HostCity':['London','Beijing','Athens','Sydney','Atlanta'],
                   'Year':[2012,2008,2004,2000,1996],
                   'No. of Participating Countries':[205,204,201,200,197]}

In [5]:
dfOlympicData = pd.DataFrame(olympicDataDict)

In [6]:
dfOlympicData

  HostCity  Year  No. of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197

In [7]:
#inna wersja by pokazać jak kompletowane są dane:
olympicDict2 = {'London':{2012:205}, 'Beijing':{2008:204}} #<-- dwa słowniki, w których każdy ma jeszcze jeden słownik w sobie

In [18]:
dfOlympicData2 = pd.DataFrame(olympicDict2)
dfOlympicData2

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

Jak widać, w przypadku posiadania słownika w słowniku, pierwsze elementy są również traktowane, jako etykiety, tylko na innej osi. Wartość liczbowa jest tylko w miejscu odpowiadającym obu etykietom.

**UWAGA!!!** <br /> Chcąc wyświetlić rzeczy tylko z jednej kolumny odwołujemy się po kropce do **nazwy kolumny**, która została przez użytkownika określona.<br /> Przykład:

In [12]:
dfOlympicData.HostCity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: HostCity, dtype: object

In [13]:
dfOlympicData.Year

0    2012
1    2008
2    2004
3    2000
4    1996
Name: Year, dtype: int64

Do wyświetlenia całej zawartości ramki danych używa się funkcji `describe`.

In [14]:
dfOlympicData.describe

<bound method NDFrame.describe of   HostCity  Year  No. of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             197>

Utworzenie ramki z szeregu:

In [23]:
sOlympicParticipation = pd.Series([205,204,201,200,197], index=[2012,2008,2004,2000,1996])
sOlympicCountries = pd.Series(['London','Bijing','Athens','Sydney','Atlanta'], index=[2012,2008,2004,2000,1996])

In [24]:
sOlympicCountries

2012     London
2008     Bijing
2004     Athens
2000     Sydney
1996    Atlanta
dtype: object

In [25]:
sOlympicParticipation

2012    205
2008    204
2004    201
2000    200
1996    197
dtype: int64

In [26]:
dfOlympicSeries = pd.DataFrame({'No. of Participating Countries':sOlympicParticipation,
                                'Host Cities':sOlympicCountries})

In [27]:
dfOlympicSeries

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204      Bijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

Utworzenie ramki z ndarray:

In [28]:
import numpy as np
npArray = np.array([2012,2008,2004,2006])
dictNdarray = {'year':npArray}

In [29]:
dfNdarray = pd.DataFrame(dictNdarray)

In [30]:
dfNdarray

   year
0  2012
1  2008
2  2004
3  2006

Utworzenie ramki z innej ramki

In [31]:
dfFromDf = pd.DataFrame(dfOlympicSeries)
dfFromDf

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204      Bijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

# Demonstracja z pobierania i podglądu danych

In [32]:
import numpy as np
import pandas as pd

In [37]:
olympicSeriesParticipation = pd.Series([205,204,201,200,197],index=[2012,2008,2004,2000,1996])
olympicSeriesCountry = pd.Series(['London','Beijin','Athens','Sydney','Atlanta'], index=[2012,2008,2004,2000,1996])
dfOlympic = pd.DataFrame({'No. of Participating Countries':olympicSeriesParticipation,
                          'Host Cities':olympicSeriesCountry})

In [39]:
dfOlympic

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204      Beijin
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [40]:
dfOlympic.describe

<bound method NDFrame.describe of       No. of Participating Countries Host Cities
2012                             205      London
2008                             204      Beijin
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta>

In [41]:
dfOlympic[:2]

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204      Beijin

In [160]:
#lub...
dfOlympic.head(2)

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204      Beijin

In [44]:
dfOlympic.tail(3)

      No. of Participating Countries Host Cities
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [46]:
dfOlympic.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [47]:
dfOlympic.columns

Index(['No. of Participating Countries', 'Host Cities'], dtype='object')

In [48]:
dfOlympic['Host Cities']

2012     London
2008     Beijin
2004     Athens
2000     Sydney
1996    Atlanta
Name: Host Cities, dtype: object

In [49]:
dfOlympic['No. of Participating Countries']

2012    205
2008    204
2004    201
2000    200
1996    197
Name: No. of Participating Countries, dtype: int64

In [52]:
dfOlympic.loc[2012]

No. of Participating Countries       205
Host Cities                       London
Name: 2012, dtype: object

In [57]:
#indeksowanie po pozycji
dfOlympic.iloc[0:2]

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204      Beijin

In [59]:
#indeksowanie przez podanie współrzędnych:
dfOlympic.iat[3,1]

'Sydney'

In [60]:
dfOlympic[dfOlympic['No. of Participating Countries']>200]

      No. of Participating Countries Host Cities
2012                             205      London
2008                             204      Beijin
2004                             201      Athens

# Brakujące wartości

In [61]:
import pandas as pd

In [62]:
#deklaracje szeregów:
pierSzereg = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
drugSzereg = pd.Series([10,20,30,40,50],index=['c','e','f','g','h'])
sumaSzereg = pierSzereg + drugSzereg
sumaSzereg

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [63]:
#zwraca szereg tylko z pełnymi danymi
sumaSzereg.dropna()

c    13.0
e    25.0
dtype: float64

In [65]:
# i nie wpływa na oryginał
sumaSzereg

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [70]:
podzbior = sumaSzereg.dropna()
podzbior

c    13.0
e    25.0
dtype: float64

Uzupełnienie `NaN` zerami:

In [69]:
sumaSzereg.fillna(0)

a     0.0
b     0.0
c    13.0
d     0.0
e    25.0
f     0.0
g     0.0
h     0.0
dtype: float64

Dodanie dwóch szeregów tak, żeby nie utracić danych:

In [71]:
superPierSzereg = pierSzereg.add(drugSzereg,fill_value=0)
superPierSzereg

a     1.0
b     2.0
c    13.0
d     4.0
e    25.0
f    30.0
g    40.0
h    50.0
dtype: float64

# Operacje na danych

In [72]:
import pandas as pd
#przykladowe dane:
dfMovieRating = pd.DataFrame({'movie 1':[5,4,3,3,2,1],'movie 2':[4,5,2,3,4,2]},index=['Tom','Jeff','Peter','Ram','Ted','Paul'])
dfMovieRating

       movie 1  movie 2
Tom          5        4
Jeff         4        5
Peter        3        2
Ram          3        3
Ted          2        4
Paul         1        2

In [74]:
def movieGrade(rating):
    if rating == 5:
        return 'A'
    elif rating == 4:
        return 'B'
    elif rating == 3:
        return 'C'
    else:
        return 'F'
    
print(movieGrade(5))

A

In [75]:
#zastosowanie funkcji dla każdego elementu ramki
dfMovieRating.applymap(movieGrade)

      movie 1 movie 2
Tom         A       B
Jeff        B       A
Peter       C       F
Ram         C       C
Ted         F       B
Paul        F       F

Użycie funkcji statystycznych

In [76]:
dfTestScores = pd.DataFrame({'Test1':[95,84,73,88,82,61],
                             'Test2':[74,85,82,73,77,79]},
                             index=['Jack','Lewis','Patrick','Rich','Kelly','Paula'])
dfTestScores.max()

Test1    95
Test2    85
dtype: int64

In [79]:
dfTestScores.min()

Test1    61
Test2    73
dtype: int64

In [77]:
dfTestScores.mean()

Test1    80.500000
Test2    78.333333
dtype: float64

In [78]:
dfTestScores.std()

Test1    11.979149
Test2     4.633213
dtype: float64

Grupowanie

In [80]:
dfPresidentName = pd.DataFrame({'first':['George','Bill','Ronald','Jimmy','George'],
                                'last':['Bush','Clinton','Regan','Carter','Washington']})
dfPresidentName

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [81]:
grouped = dfPresidentName.groupby('first')
grouped

In [82]:
grpData = grouped.get_group('George')
grpData

    first        last
0  George        Bush
4  George  Washington

In [83]:
dfPresidentName.sort_values('first')

    first        last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

# Standaryzacja danych

In [84]:
#obliczenia odchylenia standardowego:
def standardizeTest(test):
    return (test-test.mean())/test.std()

standardizeTest(dfTestScores['Test1'])

Jack       1.210437
Lewis      0.292174
Patrick   -0.626088
Rich       0.626088
Kelly      0.125218
Paula     -1.627829
Name: Test1, dtype: float64

In [90]:
# przeprowadzenie obliczeń dla całej ramki:
def standaridizeTestScores(dataFrm):
    return dataFrm.apply(standardizeTest)

#standaryzowana ramka:
standaridizeTestScores(dfTestScores)

            Test1     Test2
Jack     1.210437 -0.935276
Lewis    0.292174  1.438886
Patrick -0.626088  0.791387
Rich     0.626088 -1.151109
Kelly    0.125218 -0.287777
Paula   -1.627829  0.143889

# Merge, Duplicate oraz contatenation

In [91]:
import pandas as pd

In [92]:
dfStudentMath = pd.DataFrame({'student':['Tom','Jack','Dan','Ram','Jeff','David'],
                              'ID':[10,56,31,85,9,22]})

dfStudentScience = pd.DataFrame({'student':['Tom','Ram', 'David'],
                                 'ID':[10,12,22]})

**Merge**

In [96]:
#Po prostu połączenie dla pasujących 'student' jak i 'ID'
pd.merge(dfStudentMath,dfStudentScience)

  student  ID
0     Tom  10
1   David  22

In [95]:
#Połączenie dla 'student', zwraca oba 'ID'
pd.merge(dfStudentMath, dfStudentScience, on='student')

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    12
2   David    22    22

In [100]:
# Coś na zasadzie leftJoin na 'ID' oraz uzupełnienie wartości NaN poprzez 'X'
pd.merge( dfStudentMath, dfStudentScience, on='ID', how='left').fillna( 'X' )

  student_x  ID student_y
0       Tom  10       Tom
1      Jack  56         X
2       Dan  31         X
3       Ram  85         X
4      Jeff   9         X
5     David  22     David

In [101]:
# Coś na zasadzie rightJoin na 'ID' oraz uzupełnienie wartości NaN poprzez 'X'
pd.merge( dfStudentMath,dfStudentScience, on='ID', how='right' ).fillna( 'X' )

  student_x  ID student_y
0       Tom  10       Tom
1         X  12       Ram
2     David  22     David

**Concatenate** czyli powiązać

In [104]:
#połączenie dwóch ramek
pd.concat( [dfStudentMath, dfStudentScience], ignore_index=True )

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [105]:
dfStudentSurveyData = pd.DataFrame({'student':['Tom','Jack','Tom','Ram','Jeff','Jack'],
                              'ID':[10,56,10,85,9,56]})

In [106]:
dfStudentSurveyData

  student  ID
0     Tom  10
1    Jack  56
2     Tom  10
3     Ram  85
4    Jeff   9
5    Jack  56

In [107]:
#sprawdzenie powtórzeń
dfStudentSurveyData.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [108]:
#usunięcie powtarzających się elementów z kluczem jako 'student'
dfStudentSurveyData.drop_duplicates('student')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

In [109]:
#usunięcie powtarzających się elementów z kluczem jako 'ID'
dfStudentSurveyData.drop_duplicates('ID')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9

# SQL w Pandas

In [135]:
import sqlite3

In [136]:
#utworzenie tabeli SQL:
createTable = """
CREATE TABLE studentScore
( Id INTEGER, Name VARCHAR(20), Math REAL, Science REAL
);"""

In [137]:
#wykonanie polecenia SQL:
executeSQL = sqlite3.connect(':memory:')
executeSQL.execute(createTable)
executeSQL.commit() # <-- tabela jest tworzona dopiero tutaj

In [138]:
#przygotowanie zapytania:
sqlQuery = executeSQL.execute('select * from studentScore')

In [139]:
resultset = sqlQuery.fetchall()
resultset

[]

In [140]:
#wprowadzenie danych do tabeli:
insertSQL = [(10,'Jack',85,92),
             (29,'Tom',73,89),
             (65,'Ram',65.5,77),
             (5,'Steve',55,91)]

In [141]:
#wprowadzenie danych do tabeli:
insertStatement = "Insert into studentScore values(?,?,?,?)"
executeSQL.executemany( insertStatement, insertSQL )
executeSQL.commit()

In [152]:
#przygotowanie zapytania:
sqlQuery = executeSQL.execute('select * from studentScore')
resultset = sqlQuery.fetchall()
resultset

[(10, 'Jack', 85.0, 92.0),
 (29, 'Tom', 73.0, 89.0),
 (65, 'Ram', 65.5, 77.0),
 (5, 'Steve', 55.0, 91.0)]

In [158]:
#zapis z SQL do ramki danych:
dfStudentSQL = pd.DataFrame( resultset, columns = next(zip( *sqlQuery.description )))
dfStudentSQL

   Id   Name  Math  Science
0  10   Jack  85.0     92.0
1  29    Tom  73.0     89.0
2  65    Ram  65.5     77.0
3   5  Steve  55.0     91.0

In [157]:
a=zip(*sqlQuery.description)
next(a)

('Id', 'Name', 'Math', 'Science')